---
kind: type
id: T:Autodesk.Revit.DB.XYZ
zh: 点
source: html/c2fd995c-95c0-58fb-f5de-f3246cbc5600.htm
---
# Autodesk.Revit.DB.XYZ

**中文**: 点

Object representing coordinates in 3-dimensional space.

## Syntax (C#)
```csharp
public class XYZ
```

## Remarks
Usually this means a point or a vector in 3-dimensional space, depending on the actual use.